# step_03
# Запишите число 1.2345e3 в виде десятичной дроби.
# См. экспоненциальная запись.
print(f'step_03 = {1.2345e3}')

# step_04
# Запишите число 1.2345e-3 в виде десятичной дроби
print(f'step_04 = {1.2345e-3}')

#step_05
# Составьте выражение для вычисления в интерпретаторе Python 3 и вставьте в поле ответа результат вычисления:
# 2014.0**14
# Обратите внимание на запись числа: это вещественное число.
print(f'step_05 = {2014.0**14}')

#step_06
# Составьте выражение для вычисления в интерпретаторе Python 3 и вставьте в поле ответа результат вычисления:
#
# 7/3
print(f'step_05 = {7/3}')


#step_07
# Составьте выражение для вычисления в интерпретаторе Python 3 и вставьте в поле ответа результат вычисления:
#
# 7 // 37
#
# Заметьте, что деление нацело работает также и с вещественными числами и соответствует делению с
# округлением в сторону - бесконечности

print(f'step_05 = {7//3}')