# step_02
# Составьте выражение для вычисления в интерпретаторе Python 3 и вставьте в поле ответа результат вычисления.
#
# Приведите к целому типу число 2.99
print(f' step_02 {int(2.99)}')

# step_03
# Составьте выражение для вычисления в интерпретаторе Python 3 и вставьте в поле ответа результат вычисления.
#
# Приведите к целому типу число -1.6
#
# Заметьте, что приведение к целому типу вещественного числа соответствует отбрасыванию дробной составляющей,
# что соответствует округлению в сторону 00.
print(f' step_02 {int(-1.6)}')


# step_04
# Вычислите в python значение выражения
# 9**19 - int(float(9**19))
#
# Заметьте, что используется одно и то же число, но результат получается не нулевой. Это показывает различие хранения
# большого числа в целочисленном типе и типе с плавающей точкой.

print(f' step_02 {9**19 - int(float(9**19))}')