# Коля каждый день ложится спать ровно в полночь и недавно узнал, что оптимальное время для
# его сна составляет XX минут. Коля хочет поставить себе будильник так, чтобы он прозвенел ровно через
# XX минут после полуночи, однако для этого необходимо указать время сигнала в формате часы, минуты.
# Помогите Коле определить, на какое время завести будильник.
#
# Часы и минуты в выводе программы должны располагаться на разных строках (см. пример работы программы)
#
# Помните, что для считывания данных нужно вызывать функцию input без аргументов!

# put your python code here

X = int(input())
min_time = int(X / 60)
sec_time = X - min_time * 60
print(min_time)
print(sec_time)
